In [10]:
import pandas as pd
from sklearn.datasets import load_iris

IRIS=load_iris()
iris=pd.DataFrame (IRIS.data, columns=IRIS.feature_names)
iris['class'] = IRIS.target
iris['class'] = iris['class'].map({0:'setosa',1:'versicolor',2:'virginica'})
iris.groupby(by='class').mean()
iris.groupby(by='class').median()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.0,3.4,1.50,0.2
versicolor,5.9,2.8,4.35,1.3
virginica,6.5,3.0,5.55,2.0

In [15]:
iris['class'].value_counts()
iris['petal width level']=pd.qcut(iris['petal width (cm)'],q=3,labels=['short','middle','long'])
pd.Series(iris['petal width level']).value_counts().to_frame()

pd.crosstab(iris['petal width level'],iris['class'])

class              setosa  versicolor  virginica
petal width level
short                  50           0          0
middle                  0          48          4
long                    0           2         46

In [49]:
import pandas as pd
score = pd.DataFrame ({'학년':[1,1,1,1,2,2],'반':['A','A','B','B','C','C'], \
                      '성별':['여','남','여','남','여','남'],'성적':[76,88,85,72,68,70]})

score=score.pivot_table(index=['학년','반'],columns='성별',values='성적') # aggfunc='mean' 제외
score

성별       남     여
학년 반
1  A  88.0  76.0
   B  72.0  85.0
2  C  70.0  68.0

In [50]:
score.reset_index().melt(id_vars=['학년','반'],var_name='성별',value_name='성적')
# 위 pivot table에서 aggfunc를 활용한 경우에는 melt 메소드로 완벽 복구 불가

   학년  반 성별    성적
0   1  A  남  88.0
1   1  B  남  72.0
2   2  C  남  70.0
3   1  A  여  76.0
4   1  B  여  85.0
5   2  C  여  68.0

In [62]:
import numpy as np
score.apply(np.sqrt)
score.apply(np.max,axis=1)

학년  반
1   A    88.0
    B    85.0
2   C    70.0
dtype: float64

In [67]:
def plus_five(val):
    return val+5
score.apply(plus_five)

성별       남     여
학년 반
1  A  93.0  81.0
   B  77.0  90.0
2  C  75.0  73.0

In [68]:
def class_avg(df):
    return ((df['남']+df['여'])/2)
score.apply(class_avg, axis=1)

학년  반
1   A    82.0
    B    78.5
2   C    69.0
dtype: float64

In [72]:
score.map(lambda x:x+100)
score['남'].map(lambda x:x+50)

학년  반
1   A    138.0
    B    122.0
2   C    120.0
Name: 남, dtype: float64

In [75]:
'''
2장 10절 문자열 데이터 변환하기 skip

landmark['english name'].str.upper() / lower() / capitalize() / title()
landmark['location'].str[3:6] / str.split() / str.split().str.get(0) / str.replace(" ","_")
landmark['location'].str.extract('(경주)') / extract('(\d+-?\d+)') 번지수 추출
landmark['english name'].str.contains('Palace') / startswith('서울') / endswith('1')
landmark['english name'].str.strip() / lstrip('경') / rstrip('e')
'''

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\sunwa\AppData\Local\Temp\ipykernel_14000\1584891017.py:1: SyntaxWarning: invalid escape sequence '\d'
  '''

'\n2장 10절 문자열 데이터 변환하기 skip\n\nlandmark[\'english name\'].str.upper() / lower() / capitalize() / title()\nlandmark[\'location\'].str[3:6] / str.split() / str.split().str.get(0) / str.replace(" ","_")\nlandmark[\'location\'].str.extract(\'(경주)\') / extract(\'(\\d+-?\\d+)\') 번지수 추출\nlandmark[\'english name\'].str.contains(\'Palace\') / startswith(\'서울\') / endswith(\'1\')\nlandmark[\'english name\'].str.strip() / lstrip(\'경\') / rstrip(\'e\')\n'

In [76]:
from datetime import datetime
print(datetime.today())
print(datetime.today().year)

2025-03-18 13:49:55.306853
2025

In [80]:
datetime.strptime('2025-03-18 13:12:52', '%Y-%m-%d %H:%M:%S')

datetime.datetime(2025, 3, 18, 13, 12, 52)

In [84]:
time = datetime.today()
time.strftime('%y-%m-%d %H:%M:%S:%f %a %A %b %B %j %U')

'25-03-18 14:00:06:318470 Tue Tuesday Mar March 077 11'

In [93]:
from datetime import timedelta
time = datetime.today()
time + timedelta(days=100)  # month, year 모두 불가

datetime.datetime(2025, 6, 26, 14, 4, 15, 136802)